app/views/home/index.html.erb


          <%@cont = User.where(id:[f.user_id,f.contact_id])%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]