app/controllers/conversations_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def close
    @conversation = Conversation.find(params[:id])

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "conversations" SET "toggled" = ?, "updated_at" = ? WHERE "conversations"."id" = ?  [["toggled", true], ["updated_at", 2017-04-30 19:41:01 UTC], ["id", 7]]
UPDATE "users" SET "updated_at" = '2017-04-30 19:41:02.063696' WHERE "users"."id" = ?  [["id", 2]]
---
  def toggleDownscale
     @conversation = Conversation.find(params[:id])
     @conversation.toggled_users.push(current_user.id)

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "conversations" SET "toggled_users" = $1, "updated_at" = $2 WHERE "conversations"."id" = $3
UPDATE "users" SET "updated_at" = '2017-05-01 12:08:20.075841' WHERE "users"."id" = $1  [["id", 6]]
---
    def toggleUpscale
     @conversation = Conversation.find(params[:id])
     @conversation.toggled_users.delete(current_user.id)