app/controllers/home_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" IN (1, 2, 3, 4)
SELECT "lists".* FROM "lists" WHERE ("lists"."user_id" = $1 OR "lists"."contact_id" = $2)  [["user_id", 6], ["contact_id", 6]]
---
  def index
  	   session[:conversations] ||= []

    @users = User.all.where.not(id: current_user) #.where(["updated_at > ?", 10.minutes.ago])
    #@conversationbl = Conversation.where(sender_id:  current_user.id).or(Conversation.where(recipient_id: current_user.id))
    # @conversations =  @conversationbl.includes(:recipient, :messages)
    #@conversationsWithoutId = Conversation.all.where.not(["toggled_users LIKE ?", current_user.id])
    #@conv = @conversationsWithoutId.toggled_users.include?(current_user.id.to_i)
   @conversations = Conversation.includes(:recipient, :messages).find(session[:conversations])
    @list = List.where(user_id: current_user.id).or(List.where(contact_id: current_user.id))