app/controllers/lists_controller.rb

  def create
    @list = List.getList(current_user.id, params[:user_id])

   	@contact = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]