app/controllers/messages_controller.rb

	  def create
    @conversation = Conversation.includes(:recipient).find(params[:conversation_id])
    @message = @conversation.messages.create(message_params)
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "messages" ("body", "user_id", "conversation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "999"], ["user_id", 1], ["conversation_id", 2], ["created_at", 2017-03-29 00:07:52 UTC], ["updated_at", 2017-03-29 00:07:52 UTC]]